In [1]:
#Dependencies and Setup
import pandas as pd
import psycopg2
import sqlalchemy 
import matplotlib as plt
%matplotlib inline

In [2]:
#password = os.environ['Tony1pat2']
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:T<password>@localhost:5432/Employee_db')
conn = engine.connect()

In [3]:

salaries_data = pd.read_sql_query('SELECT * FROM salaries LIMIT 5;', engine)
salaries_data.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [4]:
titles_data = pd.read_sql_query('SELECT * FROM titles LIMIT 5;', engine)
titles_data.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [5]:
merge_data = pd.merge(salaries_data, titles_data, on="emp_no", how="inner", suffixes = ("_Salary","_Title"))
merge_data.head()

,emp_no,salary,from_date_Salary,to_date_Salary,title,from_date_Title,to_date_Title
0,10001,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,65828,1996-08-03,1997-08-03,Staff,1996-08-03,9999-01-01
2,10003,40006,1995-12-03,1996-12-02,Senior Engineer,1995-12-03,9999-01-01
3,10004,40054,1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,40054,1986-12-01,1987-12-01,Senior Engineer,1995-12-01,9999-01-01

In [41]:
bins = 0,39999,49999,59999,69999,79999,89999,99999,109999,119999,129999
group_labels = ["0-40k","40k-49k","50k-59k","60k-69k","70k-79k","80k-89k","90k-99k","100k-109k","110k-119k","120k-130k"]

In [51]:
pd.cut(salaries_data["salary"],bins, labels=group_labels).head()

0    60k-69k
1    60k-69k
2    40k-49k
3    40k-49k
4    70k-79k
Name: salary, dtype: category
Categories (10, object): [0-40k < 40k-49k < 50k-59k < 60k-69k ... 90k-99k < 100k-109k < 110k-119k < 120k-130k]